app/Controllers/RoleController.php

SELECT *
FROM `roles`
WHERE `roles`.`deleted_at` IS NULL
---
    public function index()
    {
        $data['roles'] = $this->roleModel->findAll();