app/Controllers/UserController.php

SELECT `usuarios`.*, `roles`.`nombre` as `rol`
FROM `usuarios`
JOIN `roles` ON `roles`.`id` = `usuarios`.`rol_id`
---
    public function index()
    {
        $data['users'] = $this->userModel->select('usuarios.*, roles.nombre as rol')->withDeleted()->join('roles', 'roles.id = usuarios.rol_id')->findAll();

SELECT *
FROM `roles`
WHERE `roles`.`deleted_at` IS NULL
---
    public function edit($id)
    {
        $data['user'] = $this->userModel->find($id);
        $data['roles'] = $this->roleModel->findAll();